app/controllers/entries_controller.rb

  def create
    @entry = Entry.new(entry_params)
    if @entry.save
---
INSERT INTO "entries" ("name", "created_at", "updated_at", "link") VALUES ('name', '2026-07-06 11:54:23.311833', '2026-07-06 11:54:23.311833', NULL) RETURNING "id"

  def destroy
    Entry.find(params[:id]).destroy
---
DELETE FROM "entries" WHERE "entries"."id" = 1
SELECT "entries".* FROM "entries" WHERE "entries"."id" = 1 LIMIT 1